//: ## Install Xcode (Способы установки среды разработки IDE)
//:
/*:
 Для полноценной работы в качестве iOS разработчика необходимо:

 1. иметь компьютер iMac, MacBook, Mac mini или Mac Pro с установленной ОС Mavericks (OS X 10.9), Yosemite (OS X 10.10) или El Capitan (OS X 10.11).


 2. создать учетную запись **Apple ID** и зарегистрироваться в [центре разработчиков Apple](https://developer.apple.com/register/)
 
 
 3. установить **Xcode** - возможные способы установки:
 
    1. найти **IDE** в **App Store**
    2. [использовать ссылку iTunes](https://itunes.apple.com/ua/app/xcode/id497799835?l=ru&mt=12)
    3. найти **IDE** на [сайте разработчиков Apple](https://developer.apple.com)

 
 Интегрированная среда разработки (Integrated Development Environment, **IDE**) — система программных средств, используемая программистами для разработки программного обеспечения (ПО).


 Среда разработки обычно включает в себя:

 * текстовый редактор;
 * компилятор и/или интерпретатор;
 * средства автоматизации сборки;
 * отладчик
 * также в нее встроены симуляторы iPhone, iPad, Apple Watch и Apple TV

 
 Одним из потрясающих нововведений **Xcode 7**, помимо поддержки **Swift**, является появление **playground-проектов**. **Playground-проект** — это интерактивная среда разработки, своеобразная «песочница» или «игровая площадка», где вы можете комфортно тестировать создаваемый вами код и видеть результат его исполнения в режиме реального времени.


 **Playground-проект** позволяет писать код и незамедлительно видеть результат его исполнения. Он не предназначен для создания полноценных самостоятельных проектов. Каждый playground-проект хранится в файловой системе в виде отдельного файла с одноименным расширением.
 */
//:
/*:
 
 */
//: [Playground](@next)
