/*: ## Home Work (Домашняя работа) */
//:

import Foundation

/*: ## Задание 1 */
//:
/*:
 1. Создайте псевдоним `Chessman` для типа словаря `[String:(alpha:Character, num:Int)?]`. Данный тип описывает шахматную фигуру на игровом поле. В ключе словаря должно храниться имя фигуры, например `Белый король`, а в значении — кортеж, указывающий на координаты фигуры на игровом поле. Если вместо кортежа находится `nil`, это означает, что фигура убита (не имеет координат на игровом поле).
 
 
 2. Создайте переменный словарь `Chessmans` типа `Chessman` и добавьте в него три произвольные фигуры, одна из которых не должна иметь координат.
 
 
 3. Создайте конструкцию `if-else`, которая проверяет, убита ли переданная ей фигура (элемент словаря `Chessmans`), и выводит на консоль информацию либо о координатах фигуры, либо о ее отсутствии на игровом поле.
 

 4. Для получения координат переданной фигуры используйте опциональное связывание.
 
*/
//:
// 1.1


// 1.2


// 1.3


// 1.4


//:
/*: */
//: [Examples. Sets](@previous) | [Links](@next)
