/*: ## Home Work (Домашняя работа) */
//:
/*:
 1. Объявите переменную типа `String` и запишите в нее произвольный строковый литерал.
 
 
 2. Объявите константу типа `Character`, содержащую произвольный символ латинского алфавита.
 
 
 3. Объявите две переменные типа `Int` и запишите в них произвольные значения.
 
 
 4. Одним выражением объедините в строковый литерал переменную типа `String`, константу типа `Character` и сумму переменных типа `Int`, а результат запишите в новую константу.
 
 
 5. Выведите данную константу на консоль.
 
 */
//:
/*: */
//: [Unicode Representations of Strings](@previous) | [Links](@next)
