/*: ## Home Work (Домашнее задание) */
//:

import Foundation

/*: ## Задание 1: */
//:
/*:
 1. Создайте словарь аналог журнала студентов, где имя и фамилия студента - ключ, а оценка - контрольное значение. Некоторым студентам повысьте оценки - они пересдали. Потом добавьте парочку студентов, так как их только что перевели к вам в группу. А потом несколько удалите, так как они от вас ушли :(
 
 
 2. После всех этих перетрубаций посчитайте общий и средний баллы группыю
 
 
 3. Создайте словарь "дни в месяцах", где месяц - это ключ, а количество дней - значение.
 
 
 4. В цикле выведите ключ-значение попарно, причем один раз выведите через `Tuples`, а другой раз пройдитесь по массиву ключей и для каждого из них достаньте его значение.
 
 
 5. Создайте словарь, в котором ключ - это адрес шахматной клетки (пример: `a5`, `b3`, `g8`), а значение - это `Bool`. Если у клетки белый цвет, то значение `true`, а если черный - `false`. Выведите словарь в консоль и убедитесь, что все правильно.
 
    Рекомендация: постарайтесь все сделать, используя вложенный цикл.
 */
//:
// 1.1


// 1.2


// 1.3


// 1.4


// 1.5



//:
/*: ## Задание 2 */
//:
/*:
 1. Сохраните в словаре проценты для рейтинга, начиная с 10% для первого элемента и увеличивая его на 5% для каждого следующего из 4-х возможных.
 
 
 2. Используя материалы из предыдущего ДЗ по массивам расставьте рейтинги ресторанам по итоговой сумме в счете.
 */
//:
// 2.1


// 2.2

 
 
//:
/*: */
//: [Examples. Dictionaries](@previous) | [Links](@next)
