/*: ## Home Work (Домашняя работа) */
//:

import Foundation

/*: ## Задание 1: */
//:
/*:
 Создайте массив "дни в месяцах" - 12 элементов, содержащих количество дней в соответствующем месяце.
 
 Используя цикл `for` и этот массив:
 * выведите количество дней в каждом месяце (без имен месяцев)
 * используйте еще один массив с именами месяцев чтобы вывести название месяца + количество дней
 * сделайте тоже самое, но используя массив тюплов с параметрами (имя месяца, кол-во дней)
 * сделайте тоже самое, только выводите дни в обратном порядке (порядок в массиве не меняется)
 * для произвольно выбранной даты (месяц и день) посчитайте количество дней до этой даты от начала года
 */
//:
// 1.1


// 1.2


// 1.3


// 1.4


// 1.5


// 1.6


//:
/*: ## Задание 2: */
//:
/*:
 Создайте массив, состоящий `Int?` типов и посчитайте сумму всех его 5-ти элементов 3-мя способами:
 
 * вариант 1 - используя `optional binding`
 * вариант 2 - используя `forced unwrapping`
 * вариант 3 - используя оператор `??`
 */
//:
// 2.1


// 2.2


// 2.3


// 2.4


//:
/*: ## Задание 3: */
//:
/*:
 Создайте строку-алфавит и пустой массив строк.
 
 В цикле пройдитесь по всем символам строки в "прямом" порядке (слева-направо), преобразовывая каждый из них в строку и добавляя его в массив, причем так, чтобы на выходе получился массив с "обратным" алфавитом.
 */
//:
// 3.1


// 3.2


//:
/*: ## Задание 4: */
//:
/*:
 1. Создайте структуру `Restaurant` со следующими параметрами: название ресторана, общий счет за ужин, сумма чаевых. Процент чаевых составляет 20% от суммы счета. Значение суммы чаевых является рассчетным значением.
 
 
 2. Создайте 4 экземпляра структуры (имя + счет + расчет суммы чаевых) и разместите их в массиве.
 
 
 3. Используя итерацию по массиву рассчитайте для 4-х ресторанов:
 1. общую сумму чаевых
 2. общую сумму по счетам
 */
//:
// 4.1


// 4.2


// 4.3


//:
/*: */
//: [Examples. Arrays](@previous) | [Links](@next)
