/*:
 ## Home Work (Домашнее задание)
 */
//:
/*:
 ### Задание 1:
 
 1. Выведите в консоль минимальные и максимальные значения базовых типов.
 
 
 2. Создайте первые три константы с типами `Int`, `Float` и `Double`. Создайте вторые три константы (`Int`, `Float`, `Double`), где каждая из констант - это сумма первых трех констант с соотвествующими типами.
 
 
 3. Сравните две результирующие суммы с типами `Int` и `Double`, отчет о сравнении выведите в консоль.
 */
//:
/*:
 ### Задание 2:
 
 1. Объявите две пустые целочисленные переменные типов `Int8` и `Uint8`.
 

 2. В одну из них запишите **максимальное** значение, которое может принять параметр типа `Uint8`, в другую — **минимальное** значение, которое может принять параметр типа `Int8`. Обратите внимание на то, какое значение в какую переменную может быть записано.
 

 3. Выведите полученные значения на консоль.
 
 
 4. Объявите две целочисленные однотипные переменные, при этом тип данных первой должен быть задан неявно, а второй — явно. Обеим переменным должны быть присвоены значения.
 
    
 5. Поменяйте значения переменных местами.
 
 
 6. Для этого вам придется использовать еще одну переменную, которая будет служить буфером.
 
 
 7. Выведите получившиеся значения на консоль. При этом в каждом варианте выводимых данных текстом напишите, какую переменную вы выводите.
 */
//:
/*:
 ### Задание 3:
 
 1. Объявите три параметра. Первый из них должен быть константой типа `Float` с произвольным числовым значением, второй — пустой константой типа `Float`, третий — пустой переменной типа `Double`.
 
    
 2. Установите новое произвольное значение всем параметрам, для которых эта операция возможна.
 */
//:
/*:
 ### Задание 4:
 
 1. Объявите три пустые константы: одну типа `Int`, одну типа `Float` и одну типа `Double`. Сделайте это в одной строке.
 
 
 2. Проинициализируйте для них следующие значения: `Int` — `18`, `Float` — `16.4`, `Double` — `5.7`. Сделайте это в одной строке.
 
 
 3. Найдите сумму всех трех констант и запишите ее в переменную типа `Float`.
 
 
 4. Найдите произведение всех трех констант и запишите его в переменную типа `Int`. Помните, что вам необходимо получить результат с минимальной погрешностью.
 
 
 5. Найдите остаток от деления константы типа `Float` на константу типа `Double` и запишите ее в переменную типа `Double`.
 
 
 6. Выведите на консоль все три результата с использованием поясняющего текста.
 */
//:
/*:
 ### Задание 5:
 
 1. Объявите переменную типа `String` и запишите в нее произвольный строковый литерал.
 
 
 2. Объявите константу типа `Character`, содержащую произвольный символ латинского алфавита.
 
 
 3. Объявите две переменные типа `Int` и запишите в них произвольные значения.
 
 
 4. Одним выражением объедините в строковый литерал переменную типа `String`, константу типа `Character` и сумму переменных типа `Int`, а результат запишите в новую константу.
 
 
 5. Выведите данную константу на консоль.
 */
//:
/*:
 ### Задание 6:
 
 1. Объявите две логические переменные. Значение первой должно быть равно `true`, второй — `false`.
 
 
 2. Запишите в две константы результат использования их в качестве операндов для операторов логического `И` и `ИЛИ`.
 
 
 3. Выведите на консоль значения обеих получившихся констант.
 
 
 4. Вычислите результат следующих логических выражений. При этом постарайтесь не использовать `Xcode`:

        ( ( true && false ) || true )
        
        true && false && true || ( true || false )
        
        false || ( false || true ) && ( true && false )
 */
//:
/*:
 ### Задание 7:
 
 1. Объявите строковую константу и запишите в нее ваше имя.
 
 
 2. Объявите переменную типа `Double` и запишите в нее ваш вес в килограммах.
 
 
 3. Объявите переменную типа `Int` и запишите в нее ваш рост в сантиметрах.
 
 
 4. Вычислите ваш индекс массы тела и запишите его в перменную. Формула для расчета `ИМТ`:
    
        ИМТ = вес[кг] / рост[м]2
 */
//:
/*:
 ### Задание 8:
 
 1. Создайте кортеж с тремя параметрами: ваш любимый фильм, ваше любимое число и ваше любимое блюдо. Все элементы кортежа должны быть именованы.
 
 
 2. Одним выражением запишите каждый элемент кортежа в три константы.
 
 
 3. Создайте второй кортеж, аналогичный первому по параметрам, но описывающий другого человека (с другими значениями).
 
 
 4. Обменяйте значения в кортежах между собой (с использованием дополнительного промежуточного кортежа).
 
 
 5. Создайте новый кортеж, элементами которого будут любимое число из первого кортежа, любимое число из второго кортежа и разница любимых чисел первого и второго кортежей.
 */
//:
/*:
 
 */
//: [Examples](@previous) | [Links](@next)
