/*: ## String Literals (Строковые литералы) */
//:
//: Вы можете включить предопределенные `String` значения в вашем коде как строковые литералы. **Строковый литерал** - это фиксированная последовательность текстовых символов, окруженная парой двойных кавычек (`""`).
//:
//: Используйте строковый литерал как начальное значение для константы или переменной:
//:
import Foundation

let someString = "Some string literal value"
//:
//: Заметьте, что `Swift` вывел тип `String` для константы `someString`, потому что он был инициализирован строковым литеральным значением.
/*:
 * note:
 Для получения информации об использовании специальных символов в строковых литералах, смотрите главу **Unicode** символы в строковых литералах.
 */
//:
/*: */
//: [Strings and Characters](@previous) | [Examples. String Literals](@next)
