//: # Collection Types ()
//:
//: В `Swift` есть три типа коллекций для хранения наборов значений - это Массивы, Словари и Множества. *Массив* хранит упорядоченный набор значений. *Словарь* хранит неупорядоченный набор уникальных значений. *Множество* - это неупорядоченная коллекция пар `ключ-значение`.
//:
//: ![Список `Swift` коллекций](1.png)
//: В `Swift` всегда понятно, какие значения и ключи можно хранить в массивах, словарях и множествах. Это означает, что вы не можете по ошибке вставить значение в коллекцию. Это также означает, что вы можете быть уверены в типах значений, которые вы получите из коллекции.
//:
/*:
 * note:
 Забегая вперед, скажем, что Массив, Словарь и Множество в `Swift` реализованы как **универсальные коллекции**. Более подробно **универсальные типы и коллекции** мы рассмотрим на уроке **Универсальные шаблоны**.
*/
//:
/*:
 
*/
//: [Mutability of Collections](@next)
