/*: ## Terminology (Терминология) */
//:
/*:
 Операторы делятся на унарные, бинарные и тернарные:

 - `Унарные операторы` применяются к одной величине, например `(-a)`. `Унарные префиксные операторы` ставятся непосредственно перед величиной, например `(!b)`, а `унарные постфиксные операторы` — сразу за ней, например `(i!)`.

 
 - `Бинарные операторы` применяются к двум величинам, например `(2 + 3)` и являются `инфиксными`, поскольку ставятся между этими величинами.


 - `Тернарные операторы` применяются к трем величинам. Как и в языке `C`, в `Swift` есть только один такой оператор, а именно — `тернарный условный оператор`: `(a ? b : c)`.


 - Величины, к которым применяются операторы, называются `операндами`. В выражении `(1 + 2)` символ `(+)` является `бинарным оператором`, а его `операндами` служат `1` и `2`.
*/
//:
/*: */
//: [Basic Operators](@previous) | [Assignment Operator](@next)
